#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # github_branch_protection.github-management-branch-protection[0] will be created
  + resource "github_branch_protection" "github-management-branch-protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # github_branch_protection.github-management-branch-protection[1] will be created
  + resource "github_branch_protection" "github-management-branch-protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # github_branch_protection.github-management-branch-protection[2] will be created
  + resource "github_branch_protection" "github-management-branch-protection" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + blocks_creations                = false
      + enforce_admins                  = true
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = (known after apply)
      + require_conversation_resolution = false
      + require_signed_commits          = true
      + required_linear_history         = false
    }

  # github_membership.members["backdev-smart"] will be created
  + resource "github_membership" "members" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "backdev-smart"
    }

  # github_membership.members["frontdev-smart"] will be created
  + resource "github_membership" "members" {
      + downgrade_on_destroy = false
      + etag                 = (known after apply)
      + id                   = (known after apply)
      + role                 = "member"
      + username             = "frontdev-smart"
    }

  # github_repository.github-management["0"] will be created
  + resource "github_repository" "github-management" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Fronted main app repository"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "VisualStudio"
      + has_issues                  = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = false
      + license_template            = "mit"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "voxsamrt-service-api"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_repository.github-management["1"] will be created
  + resource "github_repository" "github-management" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Backend core Framework team"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "VisualStudio"
      + has_issues                  = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = true
      + license_template            = "mit"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "voxsmart-service-ui"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_repository.github-management["2"] will be created
  + resource "github_repository" "github-management" {
      + allow_auto_merge            = false
      + allow_merge_commit          = false
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + archive_on_destroy          = true
      + archived                    = false
      + auto_init                   = false
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = false
      + description                 = "Backend core Framework team"
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + gitignore_template          = "VisualStudio"
      + has_issues                  = true
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + is_template                 = true
      + license_template            = "mit"
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "voxsmart-service-sdk"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = (known after apply)
      + visibility                  = "private"
      + vulnerability_alerts        = true
      + web_commit_signoff_required = false

      + security_and_analysis {
          + secret_scanning {
              + status = "enabled"
            }
          + secret_scanning_push_protection {
              + status = "enabled"
            }
        }
    }

  # github_repository_tag_protection.github-management-tag-protection[0] will be created
  + resource "github_repository_tag_protection" "github-management-tag-protection" {
      + id                = (known after apply)
      + pattern           = "v*"
      + repository        = "voxsamrt-service-api"
      + tag_protection_id = (known after apply)
    }

  # github_repository_tag_protection.github-management-tag-protection[1] will be created
  + resource "github_repository_tag_protection" "github-management-tag-protection" {
      + id                = (known after apply)
      + pattern           = "v*"
      + repository        = "voxsmart-service-ui"
      + tag_protection_id = (known after apply)
    }

  # github_repository_tag_protection.github-management-tag-protection[2] will be created
  + resource "github_repository_tag_protection" "github-management-tag-protection" {
      + id                = (known after apply)
      + pattern           = "v*"
      + repository        = "voxsmart-service-sdk"
      + tag_protection_id = (known after apply)
    }

  # github_team.team["backend_team"] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = true
      + description               = "Team for backend developers"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "backend_team"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team.team["frontend_team"] will be created
  + resource "github_team" "team" {
      + create_default_maintainer = true
      + description               = "Team for frontend developers"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "frontend_team"
      + node_id                   = (known after apply)
      + parent_team_read_id       = (known after apply)
      + parent_team_read_slug     = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_membership.members["backend_team"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "backdev-smart"
    }

  # github_team_membership.members["frontend_team"] will be created
  + resource "github_team_membership" "members" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = (known after apply)
      + username = "frontdev-smart"
    }

  # github_team_repository.team_repo["backend_team-voxsamrt-service-api"] will be created
  + resource "github_team_repository" "team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "voxsamrt-service-api"
      + team_id    = (known after apply)
    }

  # github_team_repository.team_repo["frontend_team-voxsmart-service-sdk"] will be created
  + resource "github_team_repository" "team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "voxsmart-service-sdk"
      + team_id    = (known after apply)
    }

  # github_team_repository.team_repo["frontend_team-voxsmart-service-ui"] will be created
  + resource "github_team_repository" "team_repo" {
      + etag       = (known after apply)
      + id         = (known after apply)
      + permission = "push"
      + repository = "voxsmart-service-ui"
      + team_id    = (known after apply)
    }

Plan: 18 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + repository = {
      + "0" = {
          + allow_auto_merge                        = false
          + allow_merge_commit                      = false
          + allow_rebase_merge                      = true
          + allow_squash_merge                      = true
          + allow_update_branch                     = null
          + archive_on_destroy                      = true
          + archived                                = false
          + auto_init                               = false
          + default_branch                          = (known after apply)
          + delete_branch_on_merge                  = false
          + description                             = "Fronted main app repository"
          + etag                                    = (known after apply)
          + full_name                               = (known after apply)
          + git_clone_url                           = (known after apply)
          + gitignore_template                      = "VisualStudio"
          + has_discussions                         = null
          + has_downloads                           = null
          + has_issues                              = true
          + has_projects                            = null
          + has_wiki                                = false
          + homepage_url                            = null
          + html_url                                = (known after apply)
          + http_clone_url                          = (known after apply)
          + id                                      = (known after apply)
          + ignore_vulnerability_alerts_during_read = null
          + is_template                             = false
          + license_template                        = "mit"
          + merge_commit_message                    = "PR_TITLE"
          + merge_commit_title                      = "MERGE_MESSAGE"
          + name                                    = "voxsamrt-service-api"
          + node_id                                 = (known after apply)
          + pages                                   = []
          + primary_language                        = (known after apply)
          + private                                 = (known after apply)
          + repo_id                                 = (known after apply)
          + security_and_analysis                   = [
              + {
                  + advanced_security               = []
                  + secret_scanning                 = [
                      + {
                          + status = "enabled"
                        },
                    ]
                  + secret_scanning_push_protection = [
                      + {
                          + status = "enabled"
                        },
                    ]
                },
            ]
          + squash_merge_commit_message             = "COMMIT_MESSAGES"
          + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
          + ssh_clone_url                           = (known after apply)
          + svn_url                                 = (known after apply)
          + template                                = []
          + topics                                  = (known after apply)
          + visibility                              = "private"
          + vulnerability_alerts                    = true
          + web_commit_signoff_required             = false
        }
      + "1" = {
          + allow_auto_merge                        = false
          + allow_merge_commit                      = false
          + allow_rebase_merge                      = true
          + allow_squash_merge                      = true
          + allow_update_branch                     = null
          + archive_on_destroy                      = true
          + archived                                = false
          + auto_init                               = false
          + default_branch                          = (known after apply)
          + delete_branch_on_merge                  = false
          + description                             = "Backend core Framework team"
          + etag                                    = (known after apply)
          + full_name                               = (known after apply)
          + git_clone_url                           = (known after apply)
          + gitignore_template                      = "VisualStudio"
          + has_discussions                         = null
          + has_downloads                           = null
          + has_issues                              = true
          + has_projects                            = null
          + has_wiki                                = false
          + homepage_url                            = null
          + html_url                                = (known after apply)
          + http_clone_url                          = (known after apply)
          + id                                      = (known after apply)
          + ignore_vulnerability_alerts_during_read = null
          + is_template                             = true
          + license_template                        = "mit"
          + merge_commit_message                    = "PR_TITLE"
          + merge_commit_title                      = "MERGE_MESSAGE"
          + name                                    = "voxsmart-service-ui"
          + node_id                                 = (known after apply)
          + pages                                   = []
          + primary_language                        = (known after apply)
          + private                                 = (known after apply)
          + repo_id                                 = (known after apply)
          + security_and_analysis                   = [
              + {
                  + advanced_security               = []
                  + secret_scanning                 = [
                      + {
                          + status = "enabled"
                        },
                    ]
                  + secret_scanning_push_protection = [
                      + {
                          + status = "enabled"
                        },
                    ]
                },
            ]
          + squash_merge_commit_message             = "COMMIT_MESSAGES"
          + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
          + ssh_clone_url                           = (known after apply)
          + svn_url                                 = (known after apply)
          + template                                = []
          + topics                                  = (known after apply)
          + visibility                              = "private"
          + vulnerability_alerts                    = true
          + web_commit_signoff_required             = false
        }
      + "2" = {
          + allow_auto_merge                        = false
          + allow_merge_commit                      = false
          + allow_rebase_merge                      = true
          + allow_squash_merge                      = true
          + allow_update_branch                     = null
          + archive_on_destroy                      = true
          + archived                                = false
          + auto_init                               = false
          + default_branch                          = (known after apply)
          + delete_branch_on_merge                  = false
          + description                             = "Backend core Framework team"
          + etag                                    = (known after apply)
          + full_name                               = (known after apply)
          + git_clone_url                           = (known after apply)
          + gitignore_template                      = "VisualStudio"
          + has_discussions                         = null
          + has_downloads                           = null
          + has_issues                              = true
          + has_projects                            = null
          + has_wiki                                = false
          + homepage_url                            = null
          + html_url                                = (known after apply)
          + http_clone_url                          = (known after apply)
          + id                                      = (known after apply)
          + ignore_vulnerability_alerts_during_read = null
          + is_template                             = true
          + license_template                        = "mit"
          + merge_commit_message                    = "PR_TITLE"
          + merge_commit_title                      = "MERGE_MESSAGE"
          + name                                    = "voxsmart-service-sdk"
          + node_id                                 = (known after apply)
          + pages                                   = []
          + primary_language                        = (known after apply)
          + private                                 = (known after apply)
          + repo_id                                 = (known after apply)
          + security_and_analysis                   = [
              + {
                  + advanced_security               = []
                  + secret_scanning                 = [
                      + {
                          + status = "enabled"
                        },
                    ]
                  + secret_scanning_push_protection = [
                      + {
                          + status = "enabled"
                        },
                    ]
                },
            ]
          + squash_merge_commit_message             = "COMMIT_MESSAGES"
          + squash_merge_commit_title               = "COMMIT_OR_PR_TITLE"
          + ssh_clone_url                           = (known after apply)
          + svn_url                                 = (known after apply)
          + template                                = []
          + topics                                  = (known after apply)
          + visibility                              = "private"
          + vulnerability_alerts                    = true
          + web_commit_signoff_required             = false
        }
    }

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @erasmolpa, Action: `pull_request`*